Отладка = Новый Запрос;
Отладка.Текст = "
|ВЫБРАТЬ
|	Журнал.Сделка КАК Сделка,
|	МИНИМУМ(Журнал.Дата) КАК Дата
|ПОМЕСТИТЬ ВтДатыСортировки
|ИЗ
|	РегистрСведений.УПДК_ЖурналДокументовПоКлиенту КАК Журнал
|ГДЕ
|	Журнал.Объект ССЫЛКА Документ.CRM_Событие
|	И ВЫРАЗИТЬ(Журнал.Объект КАК Документ.CRM_Событие).СостояниеСобытия <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
|	И ВЫРАЗИТЬ(Журнал.Объект КАК Документ.CRM_Событие).СостояниеСобытия <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
|	И ВЫРАЗИТЬ(Журнал.Объект КАК Документ.CRM_Событие).СостояниеСобытия <> ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.ПустаяСсылка)
|	И НЕ Журнал.Сделка.ПометкаУдаления
|
|СГРУППИРОВАТЬ ПО
|	Журнал.Сделка
|
|ИНДЕКСИРОВАТЬ ПО
|	Сделка  
|;
|
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ ПЕРВЫЕ 10
|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
|	СделкиОбщая.Сделка КАК Сделка,
|	СделкиОбщая.РегистраторСделки КАК РегистраторСделки,
|	СделкиОбщая.Клиент.Наименование КАК НаименованиеКлиента,
|   ВЫБОР
|     КОГДА &УпорядочиватьПоДатеСделки 
|        ТОГДА СделкиОбщая.Сделка.Дата
|     ИНАЧЕ ЕСТЬNULL(ВтДатыСортировки.Дата, СделкиОбщая.Сделка.Дата)
|   КОНЕЦ КАК ДатаСортировки,
|	ВЫБОР
|      КОГДА &УпорядочиватьПоДатеСделки 
|         ТОГДА 1
|      ИНАЧЕ ВЫБОР
|   	       КОГДА ВтДатыСортировки.Дата ЕСТЬ NULL 
|        		 ТОГДА 1
|     		   ИНАЧЕ 0
|            КОНЕЦ
|   КОНЕЦ КАК ПриоритетСортировки
|ПОМЕСТИТЬ ВтСделкиНумерованные
|ИЗ
|	РегистрСведений.СделкиОбщая КАК СделкиОбщая
|		ЛЕВОЕ СОЕДИНЕНИЕ ВтДатыСортировки КАК ВтДатыСортировки
|		ПО СделкиОбщая.Сделка = ВтДатыСортировки.Сделка
|ГДЕ
|   СделкиОбщая.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)   
|	И СделкиОбщая.Этап = &ЭтапВоронки И (СделкиОбщая.Сделка.Ответственный В (&Ответственные)
|           ИЛИ СделкиОбщая.Сделка.ОтветственныйЗаТекущийЭтап В (&Ответственные)
|			ИЛИ СделкиОбщая.РегистраторСделки.Ответственный В (&Ответственные)
|			ИЛИ ИСТИНА В
|				(ВЫБРАТЬ
|					ИСТИНА
|				ИЗ
|					РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
|				ГДЕ
|					СделкиОбщая.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
|					И ИсполнителиЗадач.Исполнитель В (&Ответственные)))
|
|           И НЕ СделкиОбщая.Сделка.ПометкаУдаления 
|
|УПОРЯДОЧИТЬ ПО
|ДатаСортировки УБЫВ,
|ПриоритетСортировки
|
|ИНДЕКСИРОВАТЬ ПО
|	Сделка,
|	РегистраторСделки,
|	НаименованиеКлиента,
|	НомерЗаписи 
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтСделкиНумерованные.НомерЗаписи КАК НомерЗаписи,
|	ВтСделкиНумерованные.Сделка КАК Сделка,
|	ВтСделкиНумерованные.РегистраторСделки КАК РегистраторСделки,
|	ВтСделкиНумерованные.ДатаСортировки КАК ДатаСортировки,
|	ВтСделкиНумерованные.ПриоритетСортировки КАК ПриоритетСортировки
|ПОМЕСТИТЬ ВтСделкиОтобранныеПагинация
|ИЗ
|	ВтСделкиНумерованные КАК ВтСделкиНумерованные
|ГДЕ
|	ВтСделкиНумерованные.НомерЗаписи >= &НижняяГраница
|	И ВтСделкиНумерованные.НомерЗаписи <= &ВерхняяГраница
|
|ИНДЕКСИРОВАТЬ ПО
|	Сделка,
|	РегистраторСделки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ВтСделкиОтобранныеПагинация.Сделка КАК Сделка
|ПОМЕСТИТЬ ВтСделкиОтобранныеПагинацияУникальные
|ИЗ
|	ВтСделкиОтобранныеПагинация КАК ВтСделкиОтобранныеПагинация
|
|ИНДЕКСИРОВАТЬ ПО
|	Сделка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтСделкиОтобранныеПагинацияУникальные.Сделка КАК deal_id,
|	Журнал.Объект КАК event_id,
|	ПРЕДСТАВЛЕНИЕ(Журнал.Объект) КАК event_representation,
|	Журнал.Дата КАК event_date,
|	ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(Журнал.Объект КАК Документ.CRM_Событие).Проект) КАК event_type,
|	ВЫБОР
|		КОГДА Журнал.Дата < &ТекДата
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК overdue
|ИЗ
|	ВтСделкиОтобранныеПагинацияУникальные КАК ВтСделкиОтобранныеПагинацияУникальные
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УПДК_ЖурналДокументовПоКлиенту КАК Журнал
|	    ПО ВтСделкиОтобранныеПагинацияУникальные.Сделка = Журнал.Сделка
|		И Журнал.Объект ССЫЛКА Документ.CRM_Событие 
|		И ВЫРАЗИТЬ(Журнал.Объект КАК Документ.CRM_Событие).СостояниеСобытия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.ВРаботе)
|ГДЕ
|   НЕ Журнал.Сделка.ПометкаУдаления
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтСделкиОтобранныеПагинацияУникальные.Сделка КАК deal_id,
|	Журнал.Объект КАК event_id,
|	ПРЕДСТАВЛЕНИЕ(Журнал.Объект) КАК event_representation,
|	Журнал.Дата КАК event_date,
|	ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(Журнал.Объект КАК Документ.CRM_Событие).Проект) КАК event_type,
|	ВЫБОР
|		КОГДА Журнал.Дата < &ТекДата
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК overdue
|ИЗ
|	ВтСделкиОтобранныеПагинацияУникальные КАК ВтСделкиОтобранныеПагинацияУникальные
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УПДК_ЖурналДокументовПоКлиенту КАК Журнал
|	    ПО ВтСделкиОтобранныеПагинацияУникальные.Сделка = Журнал.Сделка
|		И Журнал.Объект ССЫЛКА Документ.CRM_Событие 
|		И ВЫРАЗИТЬ(Журнал.Объект КАК Документ.CRM_Событие).СостояниеСобытия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Запланировано)
|ГДЕ
|	НЕ Журнал.Объект.ПометкаУдаления
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	СделкиОбщая.Сделка КАК Сделка,
|	СделкиОбщая.ОбъектНедвижимости КАК ОбъектНедвижимости,
|	СделкиОбщая.РегистраторСделки КАК РегистраторСделки,
|	СделкиОбщая.Договор КАК Договор,
|	СделкиОбщая.Этап КАК Этап,
|	СделкиОбщая.Сделка.Дата КАК Дата,
|	СделкиОбщая.Клиент КАК Клиент, 
|	СделкиОбщая.Клиент.Наименование КАК НаименованиеКлиента,
|	СделкиОбщая.Сумма КАК Сумма,
|	СделкиОбщая.Запланировано КАК Запланировано,
|	СделкиОбщая.ЗапланированоТекст КАК ЗапланированоТекст,
|	СделкиОбщая.ЗапланированоДата КАК ЗапланированоДата,
|	СделкиОбщая.ХарактеристикиОбъектНедвижимостиТекст КАК ХарактеристикиОбъектНедвижимостиТекст,
|ВЫБОР
|	КОГДА СделкиОбщая.Сделка.ОтветственныйЗаТекущийЭтап = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
|		ТОГДА СделкиОбщая.Сделка.Ответственный
|	ИНАЧЕ СделкиОбщая.Сделка.ОтветственныйЗаТекущийЭтап
|КОНЕЦ КАК ОтветственныйЗаТекущийЭтап,
|   СделкиОбщая.Сделка.Ответственный КАК Ответственный,
|	СделкиОбщая.Проект КАК Проект,
|	СделкиОбщая.Сделка.АгентствоНедвижимости КАК АгентствоНедвижимости,
|	СделкиОбщая.РегистраторСделки.Ответственный КАК РегистраторСделкиОтветственный,
|	"""" КАК Разделитель,
|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(СделкиОбщая.Сделка.ИсточникПервичногоИнтереса), """") КАК ИсточникПервичногоИнтереса,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(СделкиОбщая.Сделка.ОтветственныйЗаТекущийЭтап.Наименование, """") = """"
|			ТОГДА ЕСТЬNULL(СделкиОбщая.Сделка.Ответственный.Наименование, """")
|		ИНАЧЕ ЕСТЬNULL(СделкиОбщая.Сделка.ОтветственныйЗаТекущийЭтап.Наименование, """")
|	КОНЕЦ КАК ФИО_ОтветственныйЗаТекущийЭтап,
|	ЕСТЬNULL(СделкиОбщая.Сделка.Ответственный.Наименование, """") КАК ФИО_ОтветственныйСделки,
|	ВтСделкиОтобранныеПагинация.ДатаСортировки КАК ДатаСортировки,
|	ВтСделкиОтобранныеПагинация.ПриоритетСортировки КАК ПриоритетСортировки
|ИЗ
|	РегистрСведений.СделкиОбщая КАК СделкиОбщая
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСделкиОтобранныеПагинация КАК ВтСделкиОтобранныеПагинация
|		ПО СделкиОбщая.Сделка = ВтСделкиОтобранныеПагинация.Сделка
|			И СделкиОбщая.РегистраторСделки = ВтСделкиОтобранныеПагинация.РегистраторСделки
|ГДЕ
|    НЕ СделкиОбщая.Сделка.ПометкаУдаления 
|
|УПОРЯДОЧИТЬ ПО
|ДатаСортировки УБЫВ,
|ПриоритетСортировки
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЕСТЬNULL(КОЛИЧЕСТВО(СделкиОбщая.РегистраторСделки), 0) КАК КоличествоЗаписей,
|	ЕСТЬNULL(СУММА(СделкиОбщая.Сумма), 0) КАК ИтоговаяСумма
|ИЗ
|	РегистрСведений.СделкиОбщая КАК СделкиОбщая
|ГДЕ
|	СделкиОбщая.Этап = &ЭтапВоронки И (СделкиОбщая.Сделка.Ответственный В (&Ответственные)
|           ИЛИ СделкиОбщая.Сделка.ОтветственныйЗаТекущийЭтап В (&Ответственные)
|			ИЛИ СделкиОбщая.РегистраторСделки.Ответственный В (&Ответственные)
|			ИЛИ ИСТИНА В
|				(ВЫБРАТЬ
|					ИСТИНА
|				ИЗ
|					РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
|				ГДЕ
|					СделкиОбщая.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
|					И ИсполнителиЗадач.Исполнитель В (&Ответственные)))
|           И НЕ СделкиОбщая.Сделка.ПометкаУдаления";

Отладка.УстановитьПараметр("УпорядочиватьПоДатеСделки", Ложь);
Отладка.УстановитьПараметр("ВерхняяГраница", 10);
Отладка.УстановитьПараметр("НижняяГраница", 1);
Отладка.УстановитьПараметр("ЭтапВоронки", Справочники.Ф_ЭтапыВоронкиПродаж.ОформлениеДоговора); //000000004 Договор
Отладка.УстановитьПараметр("ТекДата", '20240321142959');
Отладка.УстановитьПараметр("DateFrom", Неопределено);
Отладка.УстановитьПараметр("DateTo", Неопределено);

	Ответственные = Новый Массив;
	Ответственные.Добавить(Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("3a52611e-6b1d-11e8-836c-1cb72cafa0f8")));
Отладка.УстановитьПараметр("Ответственные", Ответственные);

	Районы = Новый Массив;

Отладка.УстановитьПараметр("Районы", Районы);

	Объекты = Новый Массив;

Отладка.УстановитьПараметр("Объекты", Объекты);

	Клиенты = Новый Массив;

Отладка.УстановитьПараметр("Клиенты", Клиенты);

	Проекты = Новый Массив;

Отладка.УстановитьПараметр("Проекты", Проекты);

	мЭтапы = Новый Массив;

Отладка.УстановитьПараметр("мЭтапы", мЭтапы);


РезультатЗапроса = Отладка.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл

КонецЦикла;
