Метод = "/ipoteka/application/api/v1/products";
	HTTPСоединение = Новый HTTPСоединение;
	HTTPЗапрос	= Новый HTTPЗапрос; 
	ПодготовитьHTTPСоединение(Метод, HTTPСоединение, HTTPЗапрос, ,Результат);
	
	Если Не Результат.Успешно  Тогда
		Возврат Результат;	
	КонецЕсли;
	
	ЗапросДляЖурнала = СтрШаблон("%1%2%3",HTTPЗапрос.АдресРесурса,  Символы.ПС , 
	УПДК_ОбщегоНазначенияКлиентСервер.ЗаголовкиВСтроку(HTTPЗапрос.Заголовки));
	
	ЗаписьЖурнала = РегистрыСведений.ЖурналОбменаAPI.ДобавитьЗапросВЖурнал("Домклик_Предложения", ТекущаяДатаСеанса(), ЗапросДляЖурнала);  
	
	Метод ="/ipoteka/application/api/v1/products/select";
	HTTPСоединение = Новый HTTPСоединение(,,,,,30,,);
	HTTPЗапрос	= Новый HTTPЗапрос; 
	Json = ПолучитьJsonМетода(Данные, Метод);
	ПодготовитьHTTPСоединение(Метод, HTTPСоединение, HTTPЗапрос, Json, Результат);
	
	Если Не Результат.Успешно  Тогда
		Возврат Результат;	
	КонецЕсли;
	
	ЗапросДляЖурнала = СтрШаблон("%1%2%3%2%4",HTTPЗапрос.АдресРесурса,  Символы.ПС , 
	УПДК_ОбщегоНазначенияКлиентСервер.ЗаголовкиВСтроку(HTTPЗапрос.Заголовки),Json);
	
	ЗаписьЖурнала = РегистрыСведений.ЖурналОбменаAPI.ДобавитьЗапросВЖурнал("Домклик_ПредложенияПоКлиенту", ТекущаяДатаСеанса(), ЗапросДляЖурнала);  

