//Договор = Задача.Предмет;
//
//Если не ЗначениеЗаполнено(Договор.ЭНКО2_ООС)
//Тогда
//	ДоговорОбъект=Договор.ПолучитьОбъект();
//	ДоговорОбъект.ЭНКО2_ООС=Задача.Исполнитель;
//	ДоговорОбъект.Записать();
//КонецЕсли;

СтруктураЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача, "Предмет, CRM_Партнер, РольИсполнителя, Исполнитель");
ЭНКО2_ООС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураЗадачи.Предмет, "ЭНКО2_ООС");
ЗакрепленныйСотрудник = БизнесПроцессыИЗадачиСервер.ПолучитьЗакрепленногоСотрудникаПоТекущемуКлиенту(СтруктураЗадачи.CRM_Партнер, Ложь, , СтруктураЗадачи.РольИсполнителя);

Если НЕ ЗначениеЗаполнено(ЭНКО2_ООС)
	ИЛИ ЗакрепленныйСотрудник = Неопределено Тогда
	ДоговорОбъект = СтруктураЗадачи.Предмет.ПолучитьОбъект();
	ДоговорОбъект.ЭНКО2_ООС = СтруктураЗадачи.Исполнитель;
	ДоговорОбъект.Записать();
	//после обновления на 21 и выше релиз, конструкцию Попытки удалить, оставить только процедуру ниже, и раскомментировать
	//БизнесПроцессыИЗадачиСервер.УстановитьСрокОтветсвенности(ДоговорОбъект.Ссылка, СтруктураЗадачи.Исполнитель, СтруктураЗадачи.РольИсполнителя);
	
	Попытка
		БизнесПроцессыИЗадачиСервер.УстановитьСрокОтветсвенности(ДоговорОбъект.Ссылка, СтруктураЗадачи.Исполнитель);
	Исключение
		БизнесПроцессыИЗадачиСервер.Расш1_УстановитьСрокОтветсвенности(ДоговорОбъект.Ссылка, СтруктураЗадачи.Исполнитель, СтруктураЗадачи.РольИсполнителя);
	КонецПопытки;
	
КонецЕсли;