
//Согласование договора | Действие14 | После принятия задачи исполнителем

//Договор = Задача.Предмет;
//
//Если не ЗначениеЗаполнено(Договор.ЭНКО2_ООС)
//Тогда
//	ДоговорОбъект=Договор.ПолучитьОбъект();
//	ДоговорОбъект.ЭНКО2_ООС=Задача.Исполнитель;
//	ДоговорОбъект.Записать();
//КонецЕсли;

СтруктураЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача, "Предмет, CRM_Партнер, РольИсполнителя, Исполнитель");
ЭНКО2_ООС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураЗадачи.Предмет, "ЭНКО2_ООС");
ЗакрепленныйСотрудник = БизнесПроцессыИЗадачиСервер.ПолучитьЗакрепленногоСотрудникаПоТекущемуКлиенту(СтруктураЗадачи.CRM_Партнер, Ложь, , СтруктураЗадачи.РольИсполнителя);

Если НЕ ЗначениеЗаполнено(ЭНКО2_ООС)
	ИЛИ ЗакрепленныйСотрудник = Неопределено Тогда
	ДоговорОбъект = СтруктураЗадачи.Предмет.ПолучитьОбъект();
	ДоговорОбъект.ЭНКО2_ООС = СтруктураЗадачи.Исполнитель;
	ДоговорОбъект.Записать();
	БизнесПроцессыИЗадачиСервер.УстановитьСрокОтветсвенности(ДоговорОбъект.Ссылка, СтруктураЗадачи.Исполнитель, СтруктураЗадачи.РольИсполнителя);
КонецЕсли;