
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивТипов = УПДК_БизнесПроцессыИЗадачи.ТипыСогласуемыхДокументов();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", МассивТипов));
	Элементы.ТипДокумента.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	НеДоступноДляРедактирования(, Запись);
	
	Если Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи) Тогда 
		Запись.Используется = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяПринятияЗадачиПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры 

&НаКлиенте
Процедура ЗакреплятьОтвественногоПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаКлиенте
Процедура СрокЗакрепленияПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	НеДоступноДляРедактирования(Элемент.Имя, Запись)
КонецПроцедуры

&НаСервере
Процедура НеДоступноДляРедактирования(Имя = Неопределено, Знач Запись)
	
	ДоступностьГруппыЗакрепления = Запись.ЗакреплятьОтвественного Или Запись.СрокЗакрепления > 0 Или ЗначениеЗаполнено(Запись.ИдентификаторОбъекта);
	
	Если Имя = Неопределено Тогда
		Если Запись.ВремяПринятияЗадачи > 0 Тогда
			Элементы.ГруппаЗакрепленияОтвестсвенного.Доступность = Ложь;
		ИначеЕсли ДоступностьГруппыЗакрепления Тогда
			Элементы.ВремяПринятияЗадачи.Доступность = Ложь;
			Элементы.УчитыватьЗанятость.Доступность = Ложь;
		КонецЕсли; 
	Иначе
		Если Имя = "ВремяПринятияЗадачи" Тогда
			Элементы.ГруппаЗакрепленияОтвестсвенного.Доступность = Не Запись.ВремяПринятияЗадачи > 0;
		КонецЕсли;
		
		Если Имя = "ЗакреплятьОтвественного" Или
			Имя = "СрокЗакрепления" Или 
			Имя = "ТипДокумента" Тогда
			Элементы.ВремяПринятияЗадачи.Доступность = Не ДоступностьГруппыЗакрепления;
			Элементы.УчитыватьЗанятость.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура УчитыватьЗанятостьПриИзменении(Элемент)
	НеДоступноДляРедактирования(Элемент.Имя, Запись);
КонецПроцедуры



