ТД = Элементы.СледующиеЭтапы.ТекущиеДанные;
	
	Если ТД.ТипДокумента <> ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.Событие") Тогда
		ТД.Уточнение = Неопределено;
		ТД.КартаМаршрута = Неопределено;
		ТД.ТочкаМаршрута = Неопределено;
	КонецЕсли;
	
	Если    ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.Событие")
		ИЛИ ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.ПредБронь")
	    ИЛИ ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.Бронь")
		ИЛИ ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.ЗакрытиеБрони")
		ИЛИ ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.ПродлениеБрони")
		ИЛИ ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.ПустаяСсылка")
		
		Тогда
		
		ТД.ТипДоговора = Неопределено;
		ТД.КартаМаршрута = Неопределено;
		ТД.ТочкаМаршрута = Неопределено;
		
	КонецЕсли;
	
	Если    ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.БизнесПроцесс")
	    Тогда
		
		ТД.ТипДоговора = Неопределено;
		ТД.Уточнение = Неопределено;
		ТД.ТочкаМаршрута = Неопределено;
		
	КонецЕсли;
	
	Если    ТД.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТриггерыКанбана.Задача")
	    Тогда
		
		ТД.ТипДоговора = Неопределено;
		ТД.КартаМаршрута = Неопределено;
		ТД.Уточнение = Неопределено;
		
	КонецЕсли;
