#Область РаспределениеЗадач 

Функция ВозможностьМенятьБрокераВДоговоре(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Метаданные.РегистрыСведений.Найти("Расш1_Дев_СрокиОтветственностиБрокеровВДоговорах") = Неопределено Тогда
		ПолноеИмя = "РегистрСведений.Расш1_Дев_СрокиОтветственностиБрокеровВДоговорах";
	Иначе
		ПолноеИмя = "РегистрСведений.Дев_СрокиОтветственностиБрокеровВДоговорах";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Т.ДатаОкончания, ДЕНЬ) < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) КАК ИзменятьРазрешено
	|ИЗ
	|	"+ПолноеИмя+" КАК Т
	|ГДЕ
	|	Т.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Договор", );
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		 Возврат Выборка.ИзменятьРазрешено;
	КонецЦикла;
	
КонецФункции

Функция ИспользуетсяРаспределениеЗадач(РольИсполнителя, КартаМаршрута, Предмет) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Предмет));
	
	//ИдентификаторОбъекта = СтандартныеПодсистемыПовтИсп.ИдентификаторОбъектаМетаданныхПоПолномуИмени(Предмет.Метаданные().ПолноеИмя());
	
	Если Не Метаданные.РегистрыСведений.Найти("Расш1_Дев_НастройкиРаспределенияЗадач") = Неопределено Тогда
		ПолноеИмя = "РегистрСведений.Расш1_Дев_НастройкиРаспределенияЗадач";
	Иначе
		ПолноеИмя = "РегистрСведений.Дев_НастройкиРаспределенияЗадач";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.Используется КАК Используется
	|ИЗ
	|	"+ПолноеИмя+" КАК Т
	|ГДЕ
	|	Т.РольИсполнителя = &РольИсполнителя
	|	И Т.КартаМаршрута = &КартаМаршрута
	|	И Т.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("КартаМаршрута", КартаМаршрута);
	Запрос.УстановитьПараметр("РольИсполнителя", РольИсполнителя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Используется;
	КонецЦикла;
	
КонецФункции 

Функция РаспределениеЗадачВключено() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Метаданные.РегистрыСведений.Найти("Расш1_Дев_НастройкиРаспределенияЗадач") = Неопределено Тогда
		ПолноеИмя = "РегистрСведений.Расш1_Дев_НастройкиРаспределенияЗадач";
	Иначе
		ПолноеИмя = "РегистрСведений.Дев_НастройкиРаспределенияЗадач";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.РольИсполнителя КАК РольИсполнителя
	|ИЗ
	|	"+ПолноеИмя+" КАК Т
	|ГДЕ
	|	Т.Используется";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСрокЗакрепления(Договор, Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Договор));
	
	//ИдентификаторОбъекта = СтандартныеПодсистемыПовтИсп.ИдентификаторОбъектаМетаданныхПоПолномуИмени(Договор.Метаданные().ПолноеИмя());
	
	Если Не Метаданные.РегистрыСведений.Найти("Расш1_Дев_НастройкиРаспределенияЗадач") = Неопределено Тогда
		ПолноеИмя = "РегистрСведений.Расш1_Дев_НастройкиРаспределенияЗадач";
	Иначе
		ПолноеИмя = "РегистрСведений.Дев_НастройкиРаспределенияЗадач";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	|	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	|ПОМЕСТИТЬ ВТ_Роли
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.Исполнитель = &Исполнитель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РольИсполнителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаРаспределений.РольИсполнителя КАК РольИсполнителя,
	|	НастройкаРаспределений.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	|	НастройкаРаспределений.СрокЗакрепления КАК СрокЗакрепления
	|ПОМЕСТИТЬ ВТ_Настройка
	|ИЗ
	|	"+ПолноеИмя+" КАК НастройкаРаспределений
	|ГДЕ
	|	НастройкаРаспределений.ИдентификаторОбъекта = &ИдентификаторОбъекта
	|	И НастройкаРаспределений.ЗакреплятьОтвественного
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РольИсполнителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Настройка.СрокЗакрепления КАК СрокЗакрепления
	|ИЗ
	|	ВТ_Роли КАК ВТ_Роли
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Настройка КАК ВТ_Настройка
	|		ПО ВТ_Роли.РольИсполнителя = ВТ_Настройка.РольИсполнителя";
	
	Запрос.УстановитьПараметр("Исполнитель", Пользователь);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0; 
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СрокЗакрепления; 
	КонецЦикла;
	
КонецФункции 

Функция ПрикрепленныйБрокер(Документ) Экспорт
	
	Если Не Метаданные.РегистрыСведений.Найти("Расш1_Дев_СрокиОтветственностиБрокеровВДоговорах") = Неопределено Тогда
		ПолноеИмя = "РегистрСведений.Расш1_Дев_СрокиОтветственностиБрокеровВДоговорах";
	Иначе
		ПолноеИмя = "РегистрСведений.Дев_СрокиОтветственностиБрокеровВДоговорах";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Т.Пользователь КАК Пользователь
	|ИЗ
	|	"+ПолноеИмя+" КАК Т
	|ГДЕ
	|	Т.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат  Выборка.Пользователь;
	КонецЦикла;
	
КонецФункции

#КонецОбласти