Ответ = Новый HTTPСервисОтвет(200);
Ответ.Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8"); 

ИмяМетода = Запрос.ПараметрыURL["ИмяМетода"];    	
ТелоКакСтрока = Запрос.ПолучитьТелоКакСтроку(); 

ЗаписьЖурнала = РегистрыСведений.ЖурналОбменаAPI.ДобавитьЗапросВЖурнал("Домклик_POST", ТекущаяДатаСеанса(), ТелоКакСтрока);
Если ИмяМетода = "status" Тогда
	СтруктураЗапроса = УПДК_ОбщегоНазначенияКлиентСервер.ПрочитатьJsonИзСтроки(ТелоКакСтрока);
	Дев_ИнтеграцияДомкликСервер.ИзменениеСтатусаСделки(СтруктураЗапроса, ЗаписьЖурнала, Ответ);	
КонецЕсли;  

Возврат Ответ;
