ТекстВопроса = НСтр("ru='Стартовать согласование договора?'");
ДополнительныеПараметры = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
ДополнительныеПараметры.ПредлагатьБольшеНеЗадаватьЭтотВопрос=Ложь;
ДополнительныеПараметры.Картинка = БиблиотекаКартинок.ДиалогВопрос; 
ДополнительныеПараметры.БлокироватьВесьИнтерфейс=истина;
Оповещение = Новый ОписаниеОповещения("ЭНКОСтартоватьПроцесс", ЭтаФорма);
СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,ДополнительныеПараметры);

уи_._отф(запрос)


Таблицу значений из обертки Com-объета
СтрокаРезультат = ВнешняяБД.ValueToStringInternal(Запрос.Выполнить().Выгрузить());
ТабВнешняя = ЗначениеИзСтрокиВнутр(СтрокаРезультат);

ОбновитьПовторноИспользуемыеЗначения()