ТекстВопроса = НСтр("ru='Стартовать согласование договора?'");
ДополнительныеПараметры = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
ДополнительныеПараметры.ПредлагатьБольшеНеЗадаватьЭтотВопрос=Ложь;
ДополнительныеПараметры.Картинка = БиблиотекаКартинок.ДиалогВопрос; 
ДополнительныеПараметры.БлокироватьВесьИнтерфейс=истина;
Оповещение = Новый ОписаниеОповещения("ЭНКОСтартоватьПроцесс", ЭтаФорма);
СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,ДополнительныеПараметры);

уи_._отф(запрос)


Таблицу значений из обертки Com-объета
СтрокаРезультат = ВнешняяБД.ValueToStringInternal(Запрос.Выполнить().Выгрузить());
ТабВнешняя = ЗначениеИзСтрокиВнутр(СтрокаРезультат);

ОбновитьПовторноИспользуемыеЗначения()

//как добавлять в список выбора
Пока Выборка.Следующий() Цикл            
	Регионы.Добавить(Выборка.КодСубъектаРФ, Выборка.Наименование); 
	Элементы.Регион.СписокВыбора.Добавить(Выборка.Наименование);
	Если Строка(Выборка.КодСубъектаРФ) = Объект.КодРегиона Тогда
		 Регион = Выборка.Наименование;
	КонецЕсли;
КонецЦикла;

ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.Номенклатура");

ОбновитьНумерациюОбъектов(Метаданные.НайтиПоПолномуИмени("Справочник.")) 

Если ОбменДанными.Загрузка Тогда
	Возврат;
КонецЕсли;

Если НЕ ПометкаУдаления = Ссылка.ПометкаУдаления И Ссылка.ПометкаУдаления Тогда
	
	// т.к. пометили на удаление, удаляем все оповещения связанные с объектом
	CRM_ОповещенияСервер.УдалитьОповещения(Ссылка);
	
КонецЕсли;

ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект,,РежимЗ);

